export const pledgeContent = `
구구절절 재미없는 인생/학교생활 이야기와 장황한 자기소개, 과장이 포함된 어필은 하지 않겠습니다. 그런 말은 누구나 다 하는 뻔한 이야기니까요.

믿기지 않을 수도 있겠지만 저는 누군가에게 도움을 주는 것에 진심인, 그리고 그 도움을 통해 함께 성장하는 것에 기쁨을 느끼는 희한한 사람입니다. 
이 자기주장을 믿는 것은 자유이지만, **스마트보안솔루션과 대표**로 출마하게 된 이유도 바로 그 때문이죠.

단지 더욱더 나은 **스마트보안솔루션과**(이하 보안과)를 만들어가기 위해, 그리고 모두가 잘 먹고 잘 살도록, 사람답게 살아갈 수 있도록 최소한의 도움과 약속을 하고자 합니다.

# 1. 타 학과 교류 본격 활성화

## 1-1. 배경 및 필요성

이건 보안과를 넘어 학교 전체에 해당되는 내용인데, 개인적인 친분이 있는 학생들끼리는 타 학과라도 교류가 있겠지만 **학교 또는 학과 차원에서 직접 나선 타 학과 사이의 교류 활동이 거의 없습니다.**

특히 전공 관련 교류는 아예 없는 수준입니다만, 잘 생각해보면 각 학과의 분야별로 교류가 필요한 경우가 분명히 존재합니다. 

> 예를 들어 인공지능 시대에 필수적인 보안 분야와 클라우드 컴퓨팅 분야는 보안과에서 담당하는 부분이 크고, 반대로 보안과에서도 인공과에서 담당하는 분야인 인공지능이나 빅데이터 분석 등의 기술을 필요로 합니다.
> 
> 하지만 각 학과의 학생들은 대개 자신의 전공 분야만 공부하기 때문에 이러한 상호 보완적인 지식과 경험을 쌓기가 어렵죠.

일례로 최근에 예비 취업 맞춤반을 수강하면서 타 학과 학생들의 전공 모습을 접할 기회가 있었습니다. 그때 생각했던 것보다 타 학과 학생들간의 호기심이 상당히 많았다는 것도 느꼈습니다. 그래서 곧장 이러한 주제를 생각하게 되었죠.

그래서 저는 이와 관련하여 선두주자가 되어 타 학과와의 교류를 본격적으로 활성화하고자 합니다. 

## 1-2. 추진 방안

구체적인 내용은 각 학과의 사정에 따라 달라질 수 있겠지만, "대략 이러한 방향으로 진행된다" 정도로 이해해주시면 좋겠습니다.

가장 확실한 방법은 각 **학과끼리 통합된 별개의 전공 심화 동아리**를 활용하는 것이지 않을까 생각합니다. 자율 동아리를 만들어 각 학과의 학생들이 함께 모여 프로젝트를 진행한다거나.. 혹은 스터디와 커뮤니케이션을 하는 방식이 될 수 있겠죠.

그게 아니라면 학과 차원에서 **정기적인 교류 세미나**나 **워크숍**을 개최하는 것도 좋은 방법이라고 생각합니다. 이에 대한 구체적인 계획은 당선 이후에 타 학과 대표나 선생님들과의 협의하에 결정하도록 하겠습니다.

물론 각 과의 학생들끼리 친하지 않은 것은 분명한 사실입니다. 
하지만 늘 그래 왔듯, 지속적으로 모이면 언젠가는 친해지게 되는 것이 사람 사는 이치니까요. 적어도 저는 그럴 것이라고 믿습니다.

> **TMI**지만, 굳이 보안과대로 나선 제가 이 제안을 드렸던 이유는 제가 각 학과의 분야마다 관심이 있었기 때문입니다.
> 
> 한때 LLM에 관심을 가지고 인공지능와 ML, 그리고 MLOps에 대해 공부하려고 시도했었던 적이 있었고, 게임 엔진도 구현해보기 위해 선형대수학과 그래픽스 프로그래밍도 공부하려고도 했었습니다. (물론 너무 어려워서 중도 포기했습니다만..)
> 
> ---
> 
> 모빌리티 분야에도 관심이 많았습니다. 심지어는 보안과에 들어오기 전 1지망을 모빌리티메이커과로 결정할까 생각도 했었습니다. 아두이노나 기타 (ARM 기반의) 마이크로컨트롤러, SoC 분야에 관심이 많았었거든요. [MOS 6502 에뮬레이터를 만들어보다가](https://github.com/yulmwu/6502) 흥미가 있어 실제 MOS 6502 칩을 구매하여 이리저리 만져보려고도 했었습니다.
> 
> ![PCB](other/PCB.jpeg)
> 
> 일렉기타 연주와 음향에도 관심이 많아, 오래된 게르마늄 PNP/NPN 트랜지스터 등으로 음향 기기를 만들어보기도 했었습니다. 진공관을 다뤄보지 못한건 아쉽지만요.
> 
> 물론 회로도는 대충 인터넷에서 가져와 저항 값이나 커패시터 등의 값만 살짝 튜닝하고, PCB는 대충 동판에 에칭해서 만들거나 브레드보드에서 조립하는 수준이었지만요. (JLCPCB 같은 PCB 주문제작 회사는 나중에 가서야 알았습니다.)
> 
> 납땜 수준은 어디가서 비빌 수 있을 정도라고 자만합니다. 5년 전 18650 리튬이온 배터리를 다루다가 불낼 뻔한 사고도 이제는 추억이 되었네요.
> 
> ![ardu](other/ardu.jpg)
> 
> ---
> 
> 하지만 진짜 저의 분야를 찾고 싶었고, 클라우드가 저에게 가장 맞았던 길이였기에 보안과에 진학하게 되었습니다. 결국 클라우드 전공 동아리 Null4U 부장 자리와 지금의 스마트보안솔루션과 대표 후보자로 올라오게 되었네요.
> 
> 말이 너무 길어서 죄송합니다. 이렇듯 다양한 분야에 관심이 많았기에 타 학과 학생들과 교류하고 싶다는 생각이 더욱 강하게 들었던 것 같습니다. 저의 만족을 떠나, 보안과 학생들에게도 분명히 도움이 될 것이라고 생각합니다.

# 2. 실습실 정비 및 장비/SW 개선

## 2-1. 배경 및 필요성

두번째 공약은 **실습실 정비와 장비 및 소프트웨어 개선**입니다. 늘 쾌적한 환경이 따라줘야 공부도 잘할 수 있다고 느끼는데, 현재 보안과 실습실은 제가 생각하는 그러한 환경과는 사뭇 거리가 멀기 때문입니다.

그 중 가장 큰 문제 몇 가지를 추려보겠습니다. 

- 하드웨어적으로 **노후화**되거나 **정상 동작하지 않는 장비**들이 다소 존재함. (예: 일부 PC가 켜지지 않거나 부팅에 10분 이상 걸리는 경우, 네트워크 오류 등)
- 실습에 있어 **필수적인 소프트웨어가 없거나**, 혹은 라이선스 문제로 사용이 불가능한 경우, 또는 충돌이 발생하여 실습에 지장이 있는 경우가 있음. (예: WSL2 사용 불가, 특정 도구 설치 불가 등)
- **위생적이지 못한 부분**이 다소 있음 (경고를 무시하고 음식물 반입/섭취 등등)

이러한 문제가 이미 수차례 지적되었음에도 불구하고, 아직까지도 개선되지 않고 방치되고 있는 점이 매우 아쉽습니다. 

그 이유를 살펴보면 대개 **예산 부족**이나 **소통 부족** 때문인 것으로 보입니다. 그리고 과대표는 이런 문제를 해결하기 위해 임명되는 자리이기도 하죠.

# 3. 전공 심화 동아리 확대 및 지원 강화

## 3-1. 배경 및 필요성

각 과를 넘어 학교를 빛내는, 그리고 더 나아가 사회에 기여하는 인재를 양성하기 위해서는 **전공 심화 동아리**(이하 **전공 동아리**)의 역할이 매우 중요하다고 생각합니다.

실제로도 전공 심화 동아리 소속의 학생들이 우수한 성과를 내고, 대외적으로도 인정받는 경우가 많습니다. 선후배와의 네트워킹도 자연스럽게 형성되는 것은 덤이고요.

개인적으로 이러한 전공 동아리에 대한 확대와 지원이 더욱더 강화되어야 한다고 생각합니다. 
물론 사이버가디언즈라는 지원 프로그램이 있긴 하지만, **대부분 학과 예산으로 운영되는 실정이기 때문에 한계**가 명확합니다.

실제로도 2025학년도 전공 동아리의 지원 예산이 일찍 소진되어 저녁 식사가 제공되지 못하여 아쉬웠던 기억이, 나중에는 AWS 계정을 지원받지 못하여 사비를 들여 충당했었습니다.

## 3-2. 추진 방안

따라서 저는 전공 동아리에 대한 지원을 강화하기 위해 다음과 같은 방안을 추진하고자 합니다. 사실 예산을 늘려달라는 것은 학생으로서 한계가 있고 범위를 벗어나기 때문에, 현실적으로 가능한 범위 내에서의 방안을 제시하고자 합니다.

- **외부 후원 유치** — 특정 기업이나 기관과의 후훤을 받아 예산 확보나 장비/소프트웨어 지원을 받는 방안
- **학과 내 자원 재배치** — 불필요하거나 비효율적으로 사용되는 예산을 개선하는 방안

이 중 가장 우선적으로 가능할 만한 방안은 후자, 즉 전공 동아리 내 예산을 재배치하는 것입니다. 간혹 불필요하게 낭비되는 부분이나 비효율적으로 사용되는 부분이 존재하기 때문입니다.

이러한 부분을 개선하기 위해선 일부 전공 실력을 요구하는데, 학과 대표로 나선 만큼 제가 그 역할을 충분히 해낼 수 있을 것이라고 생각합니다.

# 4. 전공 교육 강화 및 커뮤니티 활성화

## 4-1. 배경 및 필요성

소개해드릴 마지막 핵심 공약은 **전공 교육 강화 및 커뮤니티 활성화**입니다. 앞서 말하였듯 저는 모두가 잘 먹고 잘 살 수 있었으면 좋겠다고 생각합니다. 하지만 현실은 그렇지가 않죠.

모두가 다 잘 먹고 잘 사는건 아닐지라도, 최소한 사람답게 살아갈 수 있도록 돕는 것이 학과 대표로서의 큰 책임이라고 생각합니다. 

이를 위해선 개개인의 흥미가 있어야 하는 것도 사실이지만, 최소한의 주입식 교육이더라도 전공 교육이 더욱더 필요한 것도 사실입니다. 특히나 여태 동안 느꼈던 것은 정규 수업만으로는 부족하다는 점입니다.

그래서 저는 전공 교육 강화와 커뮤니티 활성화를 위해 다음과 같은 방안을 추진하고자 합니다.

## 4-2. 추진 방안

- **전공 동아리 연계 스터디 그룹 운영** — 사실 전공 동아리에 부담을 가지고 참여하지 않는 학생들도 많을 것입니다. 그것이 선배들에 대한 부담감이나 실력에 대한 부담감, 혹은 시간 문제일 수 있겠죠. 하지만 그렇다고 해서 전공을 포기할 순 없습니다. 필요에 따라 전공 동아리와 연계하여 같이 공부를 한다거나, 멘토링 프로그램을 운영한다는 등이 있겠네요.
- **정기적인 세미나 및 워크숍 개최** — 전공 실력이 없더라도, 세미나나 발표를 듣고만 있어도 도움이 된다는 점 아시나요? 기존에 진행하던 세미나는 물론 계속 유지하되, 좀 더 개방적이고 다양한 주제를 다루는 세미나 및 워크숍을 정기적으로 개최하는 방안입니다.
- **온라인 커뮤니티 활성화** — 오프라인 모임이 어려운 경우에도 온라인 상에서 전공 관련 질문이나 토론, 정보 공유가 활발히 이루어질 수 있도록 온라인 커뮤니티를 활성화하는 방안입니다. 여기엔 Discord나 Slack과 같은 플랫폼이 있을 수 있고, Github나 자체적인 포럼(게시판)을 개발하고 운영할 수도 있겠죠.

---

이러한 방안 외에도 학생 여러분의 의견을 적극 수렴하고 반영하는 것 또한 과대표의 중대한 책임이라고 생각합니다. 

여러분의 소중한 한 표가 헛되지 않도록 최선을 다하며, 항상 책임감을 가지며 임하겠습니다. 늘 책임감있게 행동했다고는 생각되지만, 더욱더 책임감을 가질 수 있도록 노력하도록 하겠습니다.

이상으로 2026학년도 스마트보안솔루션과 과대표 후보, 김준영이였습니다. 긴 글 읽어주셔서 감사드립니다.
`
